{
  "projects": [
    {
      "title": "Self-Hosted Media Server – Automated DVD Archival & Streaming",
      "description": "Engineered a comprehensive self-hosted media server solution using headless Ubuntu deployment. Implemented automated DVD archival workflows with Docker containerization, featuring intelligent metadata extraction, file organization, and streaming capabilities. Developed custom CLI tools for streamlined media ingestion and management.",
      "technologies": ["Ubuntu", "Docker", "Bash", "CLI", "Plex"],
      "image": "/plex-logo.webp"
    },
    {
      "title": "YYC Food Trucks - Employee & Event Management System",
      "description": "Developed a comprehensive full-stack capstone project for food truck operations management. Implemented features including employee scheduling, event coordination, shift tracking, and real-time availability monitoring. Built with CI/CD workflows and automated testing.",
      "technologies": [
        "TypeScript",
        "Next.js",
        "React.js",
        "Tailwind CSS",
        "Supabase"
      ],
      "githubUrl": "https://github.com/yoohyunk/yyc-foodtruck-scheduler",
      "image": "/yycfoodtrucks.png"
    },
    {
      "title": "Rollin' in Dough",
      "description": "Architected and developed a comprehensive e-commerce platform for a local bakery business. Implemented secure payment processing, inventory management, and automated order fulfillment systems. Delivered a responsive web application enabling 24/7 online ordering with integrated payment gateway and email notification services.",
      "technologies": [
        "TypeScript",
        "Next.js",
        "React.js",
        "Tailwind CSS",
        "Square API",
        "Email.js API",
        "Firebase"
      ],
      "githubUrl": "https://github.com/yoohyunk/rollin-in-dough",
      "liveUrl": "https://rollin-in-dough.vercel.app/",
      "image": "/rollinindough.png"
    },
    {
      "title": "No Cap Cafe",
      "description": "Collaboratively developed a comprehensive restaurant management system with a team of 4 developers. Designed and implemented core business logic including table management, inventory tracking, order processing, and comprehensive reporting modules. Utilized object-oriented programming principles and database design for scalable restaurant operations.",
      "technologies": ["C#", "Visual Studio", ".NET", "MySQL"],
      "githubUrl": "https://github.com/CDanielTurner/OOP2ResturantManager",
      "image": "/nocapcafe.png"
    },
    {
      "title": "Noize",
      "description": "Contributed to a collaborative music streaming platform development project. Led frontend development initiatives including responsive UI design, advanced search functionality, secure authentication systems, and interactive music player interfaces. Implemented real-time features and optimized user experience across multiple device types.",
      "technologies": [
        "TypeScript",
        "Next.js",
        "React.js",
        "Tailwind CSS",
        "Supabase"
      ],
      "githubUrl": "https://github.com/leonamotyer/Noize",
      "image": "/noize.png"
    }
  ]
}
